In [2]:
import seaborn as sns

In [4]:
df = sns.load_dataset('flights')

In [6]:
df.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [8]:
df.shape

(144, 3)

In [14]:
df.columns

Index(['year', 'month', 'passengers'], dtype='object')

In [18]:
x = 0
for i in df['year'].unique():
    x+=1
print(x)

12

In [24]:
yar = df[df['year'] == 1960]

In [34]:
yar

     year month  passengers
132  1960   Jan         417
133  1960   Feb         391
134  1960   Mar         419
135  1960   Apr         461
136  1960   May         472
137  1960   Jun         535
138  1960   Jul         622
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

In [44]:
yar['passengers'].sum()

5714

In [60]:
df.groupby('year')['passengers'].sum()

year
1949    1520
1950    1676
1951    2042
1952    2364
1953    2700
1954    2867
1955    3408
1956    3939
1957    4421
1958    4572
1959    5140
1960    5714
Name: passengers, dtype: int64

In [63]:
df.groupby('year')['passengers'].mean()

year
1949    126.666667
1950    139.666667
1951    170.166667
1952    197.000000
1953    225.000000
1954    238.916667
1955    284.000000
1956    328.250000
1957    368.416667
1958    381.000000
1959    428.333333
1960    476.166667
Name: passengers, dtype: float64

1 Unique Years and Months

In [66]:
df['year'].unique()

array([1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959,
       1960], dtype=int64)

In [70]:
df['month'].unique()

['Jan', 'Feb', 'Mar', 'Apr', 'May', ..., 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
Length: 12
Categories (12, object): ['Jan', 'Feb', 'Mar', 'Apr', ..., 'Sep', 'Oct', 'Nov', 'Dec']

2. The total number of records

In [78]:
df.shape

(144, 3)

3. The total number of passengers across the years

In [82]:
df.groupby('year')['passengers'].sum()

year
1949    1520
1950    1676
1951    2042
1952    2364
1953    2700
1954    2867
1955    3408
1956    3939
1957    4421
1958    4572
1959    5140
1960    5714
Name: passengers, dtype: int64

4. Average number of passengers per year

In [85]:
df.groupby('year')['passengers'].mean()

year
1949    126.666667
1950    139.666667
1951    170.166667
1952    197.000000
1953    225.000000
1954    238.916667
1955    284.000000
1956    328.250000
1957    368.416667
1958    381.000000
1959    428.333333
1960    476.166667
Name: passengers, dtype: float64

5. Which year had the highest number of passengers

In [92]:
df.groupby('year')['passengers'].sum().max()

5714

6. Which month had the lowest number of pasengers(overall)

In [173]:
sam = df['passengers']
sam

0      112
1      118
2      132
3      129
4      121
      ...
139    606
140    508
141    461
142    390
143    432
Name: passengers, Length: 144, dtype: int64

7. What is the average number of passengers per month(across the years)

In [132]:
df.groupby('month')['passengers'].mean()

C:\Users\hp\AppData\Local\Temp\ipykernel_13660\1379483493.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('month')['passengers'].mean()

month
Jan    241.750000
Feb    235.000000
Mar    270.166667
Apr    267.083333
May    271.833333
Jun    311.666667
Jul    351.333333
Aug    351.083333
Sep    302.416667
Oct    266.583333
Nov    232.833333
Dec    261.833333
Name: passengers, dtype: float64

8. in which month was the number of passengers highest in 1950

In [159]:
cr = df[df['year'] == 1950]

cr

    year month  passengers
12  1950   Jan         115
13  1950   Feb         126
14  1950   Mar         141
15  1950   Apr         135
16  1950   May         125
17  1950   Jun         149
18  1950   Jul         170
19  1950   Aug         170
20  1950   Sep         158
21  1950   Oct         133
22  1950   Nov         114
23  1950   Dec         140